In [59]:
import pandas as pd

In [60]:
#1_01
bar={'이름':['메로나','비비빅','죠스바'],'가격':[300,400,250],'재고':[20,3,100]}
barDF=pd.DataFrame(bar)

In [61]:
#1_02
print(barDF.shape)
print(barDF.index)
print(barDF.columns)
print(barDF.dtypes)
print(barDF.values)
print(barDF.ndim)

(3, 3)
RangeIndex(start=0, stop=3, step=1)
Index(['이름', '가격', '재고'], dtype='object')
이름    object
가격     int64
재고     int64
dtype: object
[['메로나' 300 20]
 ['비비빅' 400 3]
 ['죠스바' 250 100]]
2

In [62]:
#1-03
barDF['가격']

0    300
1    400
2    250
Name: 가격, dtype: int64

In [63]:
#1-04
barDF[['이름','재고']]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [64]:
#1-05
barDF.iloc[1]

이름    비비빅
가격    400
재고      3
Name: 1, dtype: object

In [65]:
#1-06
barDF.iloc[[0,2]]

    이름   가격   재고
0  메로나  300   20
2  죠스바  250  100

In [66]:
#1-07
barDF.index=['일','이','삼']
barDF

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [67]:
#1-08
barDF['총가격']=0
barDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [68]:
#1-09
barDF.loc['사']=['빵빠레',550,10,0]
barDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [69]:
#1-10
barDF.loc['이','재고']=23
barDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [70]:
data = [ [ 2000, 3050, 2050, 1980], [ 7500, 2050, 2050, 1980], [15450, 15050, 15550, 14900]

]

In [71]:
#2-01
dataDF=pd.DataFrame(data,columns=['시가','고가','저가','종가'])
dataDF

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [72]:
#2-02
print(dataDF.shape)
print(dataDF.index)
print(dataDF.columns)
print(dataDF.dtypes)
print(dataDF.values)
print(dataDF.ndim)

(3, 4)
RangeIndex(start=0, stop=3, step=1)
Index(['시가', '고가', '저가', '종가'], dtype='object')
시가    int64
고가    int64
저가    int64
종가    int64
dtype: object
[[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050 15550 14900]]
2

In [73]:
#2-03
dataDF.index=['2024-01-01','2024-02-01','2024-03-01']
dataDF

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [74]:
#2-04
dataDF.columns=['Open','High','Low','Close']
dataDF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [75]:
#2-05
dataDF.loc['2024-02-01',['High','Close']]

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

In [76]:
#2-06
dataDF.loc['2024-04-01']=[3200,3550,3000,2990]
dataDF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [77]:
#2-07
dataDF.drop('2024-01-01')

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [78]:
#2-08
dataDF.loc['2024-03-01','Low']=14000
dataDF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  14000  14900
2024-04-01   3200   3550   3000   2990

In [79]:
#2-09
dataDF['Average']=0
dataDF

             Open   High    Low  Close  Average
2024-01-01   2000   3050   2050   1980        0
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0

In [80]:
#2-10
dataDF.loc['ToTal']=0
dataDF

             Open   High    Low  Close  Average
2024-01-01   2000   3050   2050   1980        0
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0
ToTal           0      0      0      0        0

데이터  
데이터프레임  
시리즈  
데이터프레임     
매트릭스    ###어레이    
시리즈  
시리즈  
데이터프레임